<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [

    // api文档设置
    'apidoc'                =>  [
        // title 标题设置
        'title' => '青春长API文档',
        // 青春长信息
        'info' => 'api文档自动生成开发工具，利用PHP逆向工程的反射原理实现。',
        // 版本号
        'version' => 'apidoc - v1.0',
        // 想加的在这里随便加信息，前台还能加的地方只有头部尾部和两侧了
        // 菜单生成
        'menu' => [
            // 菜单1
            '公共API' =>
            [
                '短信接口'=>[]
                '邮件接口'=>[]
            ],
            '前端模块API' =>
            [
                '登录模块'=>['url'=>'api/Login/login',],
                '注册模块'=>['url'=>'api/Login/login',],
            ],
            '后端模块API' =>
            [
                '登录模块'=>['url'=>'api/Login/login',],
                '控制模块'=>['url'=>'api/Login/login',],
            ],
        ],
    ],
];
